#pragma once

namespace ProjConst 
{
	const int WND_INI_WIDTH = 800;
	const int WND_INI_HEIGHT = 600;
	
	const wchar_t* WND_MAIN_CLASS_NAME = L"MainWnd";
	const wchar_t* WND_MAIN_CAPTION = L"Tables";

	const COLORREF WND_MAIN_INI_COLOR = RGB(255, 255, 255);

	const int TEXT_FORMAT_DRAW = DT_LEFT | DT_WORDBREAK | DT_WORD_ELLIPSIS;
	const int TEXT_FORMAT_COUNT = DT_LEFT | DT_WORDBREAK | DT_CALCRECT | DT_WORD_ELLIPSIS;

	const int ROWS = 3;
	const int COLUMNS = 3;

	const LPCWSTR TEXT[]
	{
		L"Я в своем познании настолько преисполнился, что я как будто бы уже сто триллионов миллиардов лет проживаю на триллионах и триллионах таких же планет, как эта Земля, мне этот мир абсолютно понятен, и я здесь ищу только одного - покоя, умиротворения и вот этой гармонии, от слияния с бесконечно вечным, от созерцания великого фрактального подобия и от вот этого замечательного всеединства существа, бесконечно вечного, куда ни посмотри, хоть вглубь - бесконечно малое, хоть ввысь - бесконечное большое, понимаешь ? ", 
		L"А ты мне опять со своим вот этим, иди суетись дальше, это твоё распределение, это твой путь и твой горизонт познания и ощущения твоей природы, он несоизмеримо мелок по сравнению с моим, понимаешь ? ", 
		L"Я как будто бы уже давно глубокий старец,",
		L"бессмертный, ну или там уже почти бессмертный, ", 
		L"который на этой планете от её самого зарождения, ещё когда только Солнце только - только сформировалось как звезда, и вот это газопылевое облако, вот, после взрыва, Солнца,", 
		L"когда оно вспыхнуло, как звезда, начало формировать вот эти коацерваты, планеты,",
		L"понимаешь, я на этой Земле уже как будто почти пять миллиардов лет живу и знаю её вдоль и поперёк этот весь мир,", 
		L"а ты мне какие - то... мне не важно на твои тачки, на твои яхты, на твои квартиры, там, на твоё благо.", 
		L"Я был на этой планете бесконечным множеством, и круче Цезаря, и круче Гитлера, и круче всех великих, понимаешь, был, а где - то был ещё хуже, чем здесь.Я множество этих состояний чувствую.",
	};
}
